In [ ]:
#create a simple dataframe
#importing pandas as pd
import pandas as pd 
import numpy as np

#creating a dataframe
df = pd.DataFrame({'A':['John','Boby','Mina','Peter','Nicky'],
                  'B':['Masters','Graduate','Graduate','Masters','Graduate'],
                  'C':[27,23,21,23,24]})
df

In [2]:
#simplest pivot table must have a dataframe
#and on index/list of index
table = pd.pivot_table(df,index = ['A','B'])

table

                 C
A     B
Boby  Graduate  23
John  Masters   27
Mina  Graduate  21
Nicky Graduate  24
Peter Masters   23

In [11]:
#creates a pivot table dataframe
table = pd.pivot_table(df, values = 'A', index = ['B','C'],
                      columns =['B'], aggfunc = np.sum)

table

B           Graduate Masters
B        C
Graduate 21     Mina     NaN
         23     Boby     NaN
         24    Nicky     NaN
Masters  23      NaN   Peter
         27      NaN    John